'''
Напишите программу ввода строки и отображения на экране
ее первого и последнего символа в виде одной строки.
'''


# put your python code here
s1 = input()
print(s1[0] + s1[-1])
