'''
Напишите программу отображения всех символов с нечетными индексами из введенной строки.
'''


# put your python code here
s1 = input()
print(s1[1::2])