'''
Напишите программу отображения первых четырех символов из введенной строки.
Будем полагать, что строка гарантированно длиной не менее четырех символов.
'''


# put your python code here
s1 = input()
print(s1[:4])