'''
Напишите программу отображения последних трех символов из введенной строки.
Будем полагать, что строка гарантированно длиной не менее трех символов.
'''


# put your python code here
s1 = input()
print(s1[-3] + s1[-2] + s1[-1])