'''
Напишите программу, в которой вводятся
два целых положительных числа и в консоль
выводится результат возведения первого числа
в степень второго.
'''


# put your python code here
s1, s2 = map(int, input().split())
print(s1**s2)