'''
Составить программу вывода на экран вещественного числа,
вводимого с клавиатуры. Выводимому числу должно предшествовать
сообщение "Вы ввели число" (без кавычек).
'''


# put your python code here
num = float(input())
print(f'Вы ввели число {num}')