'''
Напишите программу вывода переменной
math.pi с точностью до тысячных (три знака после запятой).
'''


# put your python code here
import math
print(round(math.pi, 3))