'''
Напишите программу ввода двух строк (каждая вводится с новой строки)
и их объединения в одну строку через пробел. Результат выведите на экран.
'''


# put your python code here
s1 = str(input())
s2 = str(input())
print(s1 + ' ' + s2)
