'''
Написать программу ввода строки и формирования новой строчки вида: "Строка: <введенная строка>.
Длина: <длина строки>". Результат сформированной строки вывести на экран.
P. S. В программе F-строки не использовать.
'''


# put your python code here
s1 = input()
print('Строка: ' + s1 + '. Длина:', len(s1))